# pandas basic

This notebook goes through the basic of the pandas package

In [1]:
import numpy as np
import pandas as pd

## Series

A one-dimensional array like object

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
pd.Series(np.array([4, 7, -5, 3]))

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

### Indexes

In [5]:
obj.index   # Getting the index of a Series

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2["a"]

np.int64(-5)

In [9]:
obj2["d"] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [11]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [12]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

A Python dictionary to a Series:

In [15]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [16]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

## DataFrame

A DataFrame is a rectangular table of data (like a spreadsheet). It can also be viewed as an ordered, named collection of columns (with same index), where each column can have a potentially different type (numeric, string, Boolean, etc.) and each value in the column if of that type. DataFrames has both a row and column index like a spreadsheet.

In [17]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [18]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [19]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [20]:
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

### Indexes of DataFrames

Like for Series

In [21]:
frame.index

RangeIndex(start=0, stop=6, step=1)

### Selecting columns

A column of a DataFrame can be selected and turned into a Series:

In [22]:
frame["year"]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [23]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [24]:
frame["year"] = np.arange(6) + 1990   # using this selection to assign new values
frame

    state  year  pop
0    Ohio  1990  1.5
1    Ohio  1991  1.7
2    Ohio  1992  3.6
3  Nevada  1993  2.4
4  Nevada  1994  2.9
5  Nevada  1995  3.2

Assignment does not copy

In [25]:
frame2 = frame

In [26]:
frame2

    state  year  pop
0    Ohio  1990  1.5
1    Ohio  1991  1.7
2    Ohio  1992  3.6
3  Nevada  1993  2.4
4  Nevada  1994  2.9
5  Nevada  1995  3.2

In [27]:
frame2["year"] = np.arange(6) + 2000
frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2004  2.9
5  Nevada  2005  3.2

In [28]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2004  2.9
5  Nevada  2005  3.2

You can make a copy though:

In [29]:
frame2 = frame.copy()

In [30]:
frame2["year"] = np.arange(6) + 1990
frame2

    state  year  pop
0    Ohio  1990  1.5
1    Ohio  1991  1.7
2    Ohio  1992  3.6
3  Nevada  1993  2.4
4  Nevada  1994  2.9
5  Nevada  1995  3.2

In [31]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2003  2.4
4  Nevada  2004  2.9
5  Nevada  2005  3.2

In [32]:
frame2["Country"] = "USA"
frame2

    state  year  pop Country
0    Ohio  1990  1.5     USA
1    Ohio  1991  1.7     USA
2    Ohio  1992  3.6     USA
3  Nevada  1993  2.4     USA
4  Nevada  1994  2.9     USA
5  Nevada  1995  3.2     USA

### Selecting (or slicing) rows

In [33]:
frame2

    state  year  pop Country
0    Ohio  1990  1.5     USA
1    Ohio  1991  1.7     USA
2    Ohio  1992  3.6     USA
3  Nevada  1993  2.4     USA
4  Nevada  1994  2.9     USA
5  Nevada  1995  3.2     USA

In [34]:
frame2.loc[2]   # Using the index

state      Ohio
year       1992
pop         3.6
Country     USA
Name: 2, dtype: object

In [35]:
frame2.iloc[2]   # Using the position

state      Ohio
year       1992
pop         3.6
Country     USA
Name: 2, dtype: object

In [36]:
frame2.iloc[2:5]

    state  year  pop Country
2    Ohio  1992  3.6     USA
3  Nevada  1993  2.4     USA
4  Nevada  1994  2.9     USA

Selecting both rows and columns

In [37]:
frame2.loc[2:5, ["pop", "year"]]   # Column names do not work with iloc

   pop  year
2  3.6  1992
3  2.4  1993
4  2.9  1994
5  3.2  1995

In [38]:
frame2.iloc[2:5, 1:3]

   year  pop
2  1992  3.6
3  1993  2.4
4  1994  2.9

In [39]:
frame2.loc[:, ["pop", "year"]]   # Selecting all rows

   pop  year
0  1.5  1990
1  1.7  1991
2  3.6  1992
3  2.4  1993
4  2.9  1994
5  3.2  1995

### Selecting and replacing individual values

In [40]:
frame2

    state  year  pop Country
0    Ohio  1990  1.5     USA
1    Ohio  1991  1.7     USA
2    Ohio  1992  3.6     USA
3  Nevada  1993  2.4     USA
4  Nevada  1994  2.9     USA
5  Nevada  1995  3.2     USA

In [41]:
frame2.iloc[1,2]

np.float64(1.7)

In [42]:
frame2.iloc[1,2] = 33.3
frame2

    state  year   pop Country
0    Ohio  1990   1.5     USA
1    Ohio  1991  33.3     USA
2    Ohio  1992   3.6     USA
3  Nevada  1993   2.4     USA
4  Nevada  1994   2.9     USA
5  Nevada  1995   3.2     USA

### Dropping rows or columns

In [43]:
frame2.drop(index=[2, 4])   # Creates a copy

    state  year   pop Country
0    Ohio  1990   1.5     USA
1    Ohio  1991  33.3     USA
3  Nevada  1993   2.4     USA
5  Nevada  1995   3.2     USA

In [44]:
frame2

    state  year   pop Country
0    Ohio  1990   1.5     USA
1    Ohio  1991  33.3     USA
2    Ohio  1992   3.6     USA
3  Nevada  1993   2.4     USA
4  Nevada  1994   2.9     USA
5  Nevada  1995   3.2     USA

In [45]:
frame2.drop(columns=["pop", "year"])

    state Country
0    Ohio     USA
1    Ohio     USA
2    Ohio     USA
3  Nevada     USA
4  Nevada     USA
5  Nevada     USA

In [46]:
frame2.drop(["pop", "year"], axis="columns")

    state Country
0    Ohio     USA
1    Ohio     USA
2    Ohio     USA
3  Nevada     USA
4  Nevada     USA
5  Nevada     USA

### Function Application and Mapping

In [47]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah    1.525283 -0.051527  1.065391
Ohio   -0.320618 -0.400284  2.227789
Texas  -0.532238 -0.479203 -0.576428
Oregon -0.791396 -1.301014  0.125616

In [48]:
np.abs(frame)   # Element wise application of functions

               b         d         e
Utah    1.525283  0.051527  1.065391
Ohio    0.320618  0.400284  2.227789
Texas   0.532238  0.479203  0.576428
Oregon  0.791396  1.301014  0.125616

In [49]:
np.max(frame)

np.float64(2.227789189471957)

Functions can be applied along columns or rows:

In [50]:
frame.apply(np.max, axis="columns")

Utah      1.525283
Ohio      2.227789
Texas    -0.479203
Oregon    0.125616
dtype: float64

In [51]:
frame.apply(np.max, axis="rows")

b    1.525283
d   -0.051527
e    2.227789
dtype: float64

Max and other simple statistical functions are DataFrame methods, so they can be applied without using apply:

In [52]:
frame.max()

b    1.525283
d   -0.051527
e    2.227789
dtype: float64

In [53]:
frame.max(axis="columns")

Utah      1.525283
Ohio      2.227789
Texas    -0.479203
Oregon    0.125616
dtype: float64

### Sorting DataFrames based on columns

In [54]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [55]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [56]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [57]:
frame.sort_values(["a", "b"],  ascending=False)

   b  a
1  7  1
3  2  1
0  4  0
2 -3  0

### Calculating descriptive statistics of DataFrames

In [58]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [59]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [60]:
df.mean(axis="rows")

one    3.083333
two   -2.900000
dtype: float64

Sometimes you do not want to skip missing values, but let the missing value carry over:

In [61]:
df.mean(axis="columns", skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [62]:
df.idxmax(axis="rows")   # For each column returns the row index for which the max value is achieved

one    b
two    d
dtype: object

If a column contains other values than numerical values, we might be interested in counting how many of each values:

In [63]:
df2 = pd.DataFrame({"sample1" : ["c", "a", "d", "a", "a", "b", "b", "c", "c"], 
                    "sample2" : ["a", "a", "d", "a", "d", "d", "b", "a", "d"]})
df2

  sample1 sample2
0       c       a
1       a       a
2       d       d
3       a       a
4       a       d
5       b       d
6       b       b
7       c       a
8       c       d

In [64]:
df2["sample1"].value_counts()

sample1
c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [65]:
df2["sample1"].value_counts()

sample1
c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [66]:
df2.value_counts()

sample1  sample2
a        a          2
c        a          2
a        d          1
b        b          1
         d          1
c        d          1
d        d          1
Name: count, dtype: int64

There are other descripte statistical functions, but describe give us a decriptive overview of a DataFrame, something that often is higly valuable!

In [67]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

It cannot be applied along rows, but it is also almost always along columns we are interested in.

We can also calculate the correlation between two columns:

In [68]:
df["one"].corr(df["two"])

np.float64(-1.0)

## Reading data into Python and pandas

Reading in a classic csv file:

In [69]:
df = pd.read_csv("ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Reading in csv files with semicolon seperators:

In [70]:
dfsc = pd.read_csv("ex1semicolon.csv")
dfsc

  a;b;c;d;message
0   1;2;3;4;hello
1   5;6;7;8;world
2  9;10;11;12;foo

In [71]:
dfsc = pd.read_csv("ex1semicolon.csv", sep = ";")
dfsc

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Reading in a file without a header:

In [72]:
df2 = pd.read_csv("ex1.csv", header = None)  # The first line is turned into data - you should know in advance if your file has a header!
df2

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [73]:
df2 = pd.read_csv("ex2.csv", header = None)
df2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

Adding manual names when reading in without a header:

In [74]:
df2 = pd.read_csv("ex2.csv", names=["a", "b", "c", "d", "message"])   # We do not need the "header = None" anymore 
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Making a column into indexes:

In [75]:
df2 = pd.read_csv("ex2.csv", names=["a", "b", "c", "d", "message"], index_col="message")
df2

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

Skipping rows when reading in:

In [76]:
pd.read_csv("ex4.csv")

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [77]:
pd.read_csv("ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Writing to csv files:

In [78]:
df2

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [79]:
df2.to_csv("out.csv")

In [80]:
df2.to_csv("out.csv", index=False)

Reading in excel files:

In [81]:
pd.read_excel("ex1excel.xlsx")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [82]:
pd.read_excel("ex1excel.xlsx", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo